Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh686-v3.tmx
Source language: bo
Languages: en

source: །འཇིག་རྟེན་ཐམས་ཅད་ཀྱི་བླ་མར་ཡང་འགྱུར་རོ། །ཚིག་བཙན་པར་ཡང་འགྱུར་རོ། །འཇིག་རྟེན་ཐམས་ཅད་དགའ་བར་ཡང་འགྱུར་རོ། །ཐམས་ཅད་དུ་མཆོད་པར་འོས་པར་ཡང་འགྱུར་རོ།
en: He will become the teacher of the entire world, whose speech is pleasant to hear, who is loved by the entire world, and who is worshiped everywhere.

source: །རིག་སྔགས་ཐམས་ཅད་གྲུབ་པར་འགྱུར་རོ། །ཡིད་ལ་བསམས་པ་ཐམས་ཅད་ཡོངས་སུ་རྫོགས་པར་འགྱུར་ཞིང་། དགོས་པ་ཐམས་ཅད་གྲུབ་པར་ཡང་འགྱུར་རོ།
en: He will master every vidyā, and all his wishes will come true.

source: །ཐམས་ཅད་དུ་ཐོགས་པ་མེད་པ་མཁས་པའི་བློ་རུ་འགྱུར་རོ།
en: He will accomplish all his tasks, and his intellectual abilities will be entirely unchallenged. “

source: །དེ་ནས་ཁྲོ་བོའི་ལྕགས་ཀྱུའི་དཀྱིལ་འཁོར། ཆོ་ག་ཞིབ་མོ་ཐམས་ཅད་ཀྱི་དཀྱིལ་འཁོར་དང་། གསང་བའི་ཕྱག་རྒྱ་བླ་ན་མེད་པ་བཤད་པར་བགྱིའོ།
en: Now I will teach the maṇḍala of Krodhāṅkuśa, a supreme maṇḍala, and its secret mudrā, which is suitable for all rites.

source: །ཁོར་ཡུག་ཏུ་ཐེམ་སྐས་བཞི་དང་ལྡན་པ། ས་དང་བ་བྱུང་བསྲེས་པའི་དཀྱིལ་འཁོར་གྲུ་བཞི་པ་བྱ་སྟེ།
en: The vidyā holder should use soft clay and cow dung to construct a four-sided maṇḍala with a flight of stairs on each side.

source: གཟིངས་ཀྱི་རྒྱ་དང་ཚད་མཉམ་པ། ཤིན་ཏུ་ཚད་ལ་བབ་ཅིང་ལེགས་པར་རྣམ་པར་འབྱེས་པ།
en: It should have the right measurements, be symmetrical, and have a total area equal to a boat.

source: ལེགས་པར་བྱུགས་ཤིང་ཤིན་ཏུ་འཇམ་པ། འཇམ་ཤིང་མཉེན་པ་དང་ལྡན་པའོ།
en: Its surface should be carefully wiped, smooth, glossy, and soft.

source: །ཚོན་སྣ་ཚོགས་པས་རྣམ་པར་ཕྱེ་བ་དང་། དཀྱིལ་འཁོར་མཆོག་གི་ཐིག་བཏབ་ལ། །སྣ་ཚོགས་ཚོན་རྩིས་རྣམ་པར་དབྱེ།
en: The vidyā holder should demarcate the sections of the maṇḍala using a thread and clearly set them off using a different color for each section.

source: །སྒོ་བཞི་ཤིན་ཏུ་རྣམ་འབྱེས་པ། །ཁོར་ཡུག་ཐེམ་སྐས་བཞི་དང་ལྡན།
en: He should carefully demarcate the four doors and the four stairways so that they are distributed symmetrically.

source: །རྟ་བབས་བཞི་ཡིས་བརྒྱན་པ་སྟེ།
en: The doors should be adorned with archways. “

source: །དབུས་ཀྱི་དཀྱིལ་འཁོར་སྙིང་པོར་ཡང་།
en: Inside this maṇḍala, the vidyā holder should carefully demarcate a smaller maṇḍala that is one cubit across.

source: །ཤིན་ཏུ་རྣམ་འབྱེས་ཚད་ལ་བབ། །ཁྲུ་ཡི་ཚད་དུ་བྱ་བའོ། །དཀྱིལ་འཁོར་གྲུ་བཞི་མཉམ་པ་ཡི།
en: It should fit the measurements and have four equal sides.

source: །སྙིང་པོའི་དཀྱིལ་འཁོར་དབུས་སུ་ཡང་། །མཁས་པས་ཤིན་ཏུ་རྣམ་འབྱེས་པའི། །པདྨ་འདབ་མ་བཅུ་གཉིས་བྱ། །ལྕགས་ཀྱུ་ཕྱོགས་དང་རྩེ་གསུམ་དང་།
en: In the center of this inner maṇḍala, he should skillfully draw a well-proportioned lotus with twelve petals that is flanked by a goad and a trident.

source: །གེ་སར་པདྨའི་ཁོར་ཡུག་ཏུ། །སྙིང་པོར་གྱུར་པའི་དབུ་མཆོག་ལ།
en: In the very center of the ring of filaments, on the kernels of the pericarp, he should draw Krodhapāśa.

source: །ཁྲོ་བོ་ཞགས་པ་ཡང་བྱའོ། །དྲག་པོའི་གཟུགས་ཅན་འཇིགས་པར་བྱེད། །རལ་གྲི་དང་ནི་དགྲ་སྟའི་ཕྱག །
en: He is of wild appearance that inspires fear, and he holds a sword and an axe in his hands.

source: རལ་པའི་ཅོད་པན་གྱིས་བརྒྱན་ཅིང་། །རྒྱན་རྣམས་ཀུན་གྱིས་རྣམ་པར་བརྒྱན།
en: He wears a diadem upon his topknotted hair and is adorned with all ornaments.

source: །ལུས་ཕྱེད་པ་དང་། ཞགས་པས་ཀུན་ནས་དཀྲིས་པ།
en: Half his body is wrapped in the noose.

source: མདུང་རྩེ་གསུམ་པ། ནམ་མཁའ་ལ་ཕྱིར་ཕྱོགས་པ། པདྨ་དང་བཅས་པ་བྱས་པ་ལ།
en: He faces west and holds a trident and a lotus.

source: གྲྭ་གྲྭར་འབར་བའི་གདོང་བྱའོ། །མདུང་རྩེ་གསུམ་དང་པདྨ་ལ་རབ་ཏུ་གནས་པ།
en: In each corner the vidyā holder should draw a face, blazing with light, that is fixed upon a trident upon a lotus.

source: དྲག་པོའི་ཞལ་འཇིགས་པར་བྱེད་པ་ཆེན་པོ་མཆེ་བ་རྣམ་པར་གཙིགས་པ།
en: The face should be fierce and inspire great fear. It should be grimacing, with its terrible bared fangs protruding from its mouth.

source: ཞལ་འཇིགས་སུ་རུང་བ་འབར་བའི་སྙིང་པོར་ཆུད་པའོ།
en: It should be visualized as being permeated with light. “

source: །ནང་གི་རི་མོ་ལ། ལྕགས་སྒྲོག་དང་། མདུང་རྩེ་གསུམ་པའི་གདོང་བྲི་བར་བྱ་སྟེ། འབར་བའི་སྙིང་པོ་དང་བཅས་པ། ཁ་དོག་སྣ་ཚོགས་པའི་ཚོན་རྩིས་བྱའོ།
en: The vidyā holder should use different colors to draw an inner line of hooked tridents, glowing with inner light.

source: །རི་མོ་གཉིས་པའི་ནང་དུ། པདྨ་ཁ་ཕྱེད་བྱེ་བ་གེ་སར་འབར་བ་དང་བཅས་པའི་པདྨ་བྱའོ། །རི་མོ་གསུམ་པའི་ནང་དུ། འཁོར་ལོའི་རྣམ་པའོ།
en: The second line drawing should consist of half-opened lotuses, their filaments blazing with light.

source: །མུ་ཁྱུད་ཀྱི་ཕྱི་རོལ་ཏུ་ལག་པའི་ཕྱག་རྒྱ་ཡང་བྲི་བར་བྱ་སྟེ། མཚོན་ཆ་སྣ་ཚོགས་པ་འཛིན་པའོ། །རལ་གྲི་དང་། ཞགས་པ་དང་། མདུང་རྩེ་གསུམ་དང་། ཙ་བ་ལ་དང་། མདུང་རྩེ་གཉིས། དུང་དང་། ཏིརྱ་དང་། འཁོར་ལོ་དང་། རྩེ་གསུམ་ཁ་གདེངས་དང་། ཐོ་བ་དང་། མདུང་དང་། རལ་གྲི་དང་། ནོར་བུ་དང་། མདུང་རྩེ་གསུམ་དང་། མདའ་བོ་ཆེ་དང་། ལས་ཀྱི་རྡོ་རྗེ་དང་། རྩེ་ལྔ་དང་།
en: The third line should be drawn in the shape of a wheel with an outer rim consisting of hands displaying mudrā gestures and holding various implements, such as a sword, noose, trident, pair of bala, spear, conch, tirya, discus, three-pointed spear, hammer, javelin, scimitar, jewel, tricchulya, lance, double vajra, five-pointed spike, halberd, triple vajra, lotus, and trident.

source: པརྴ་སཱུ་ལ་དང་། རྡོ་རྗེ་ཟུར་གསུམ་དང་། པདྨ་དང་། རྩེ་གསུམ་དག་ཁ་དོག་སྣ་ཚོགས་འབར་བ་ཁོར་ཡུག་ཏུ་ཡོངས་སུ་བསྐོར་བ་བྲི་བར་བྱའོ།
en: They should be drawn blazing with light of various colors and surrounded by a decorative veranda.

source: །ཁ་ཁྱེར་གྱི་རྣམ་པས་བརྒྱན་པ་ལ་ཁ་ཁྱེར་གྱི་ཕྱི་རོལ་དཀྱིལ་འཁོར་གྱི་གནས་སུ་མཚན་མ་སྣ་ཚོགས་བྲི་བར་བྱ་སྟེ།
en: In the area of the maṇḍala outside the veranda, the vidyā holder should draw various symbols.

source: རིགས་ཆེན་པོ་བཞི་ཐུན་མོང་བའི་དཀྱིལ་འཁོར་གྱི་ཕྱག་རྒྱ་བྲི་བར་བྱའོ།
en: He should draw a circle of the mudrā symbols that are shared by the four great families. “

source: །ཤར་གྱི་གནས་སུ། དེ་བཞིན་གཤེགས་པའི་རིགས་ཀྱི་མཚན་མའི་ཕྱག་རྒྱ་ཡང་བྲི་བར་བྱའོ།
en: Within the eastern section of this circle of mudrās he should draw the mudrās and symbols of the tathāgata family.

source: །ལྷོ་རུ་པདྨ་ཡངས་པའི་མཚན་མ་དཀྱིལ་འཁོར་གྱི་ཕྱག་རྒྱའོ།
en: In the southern section he should draw the mudrās and symbols of the great lotus family.

source: །ནུབ་ཀྱི་གནས་ཀྱི་དཀྱིལ་འཁོར་དུ། ནོར་བུའི་རིགས་ཀྱི་མཚན་མའི་ཕྱག་རྒྱ་རྣམས་ཀྱང་བྲི་བར་བྱའོ།
en: In the western section he should draw the mudrās and symbols of the jewel family.

source: །བྱང་དུ་རྡོ་རྗེའི་རིགས་ཀྱི་མཚན་མའི་ཕྱག་རྒྱ་ཡང་དག་པར་བྲིའོ།
en: In the northern section he should draw the mudrās and symbols of the vajra family.

source: །ཤར་གྱི་སྒོ་རུ། དེ་བཞིན་གཤེགས་པའི་རིགས་ཀྱི་ཁྲོ་བོའི་རྒྱལ་པོ་སྒོ་རུ་བྲི་བར་བྱའོ།
en: At the eastern door he should draw the krodharāja of the tathāgata family.

source: །ལྷོ་རུ་པདྨ་ཡངས་པའི་དཀྱིལ་འཁོར་གྱི་ཁྲོ་བོ་རྣམས་སོ།
en: At the southern door he should draw the krodharāja of the great lotus-family maṇḍala.

source: །ནུབ་ཏུ་ནོར་བུ་རིགས་ཀྱི་ཁྲོ་བོའོ།
en: At the western door he should draw the krodharāja of the jewel family.

source: །བྱང་དུ་རྡོ་རྗེའི་རིགས་ཀྱི་ཁྲོ་བོ་བྲི་བར་བྱའོ།
en: At the northern door he should draw the krodharāja of the vajra family. “

source: །ཁྲོ་བོ་ཐམས་ཅད་ཀྱི་གཟུགས་འབར་བའི་སྙིང་པོ། རྒྱན་ཐམས་ཅད་ཀྱིས་རྣམ་པར་བརྒྱན་པ།
en: The forms of the krodharājas all have an inner fiery glow and are adorned with all ornaments.

source: ལག་པ་བཞི་པ། མཚོན་ཆ་སྣ་ཚོགས་པ་འཛིན་པ་བྱའོ།
en: They should each be drawn with four hands in which they hold various implements.

source: །རི་རབ་ལ་གནས་པ། སྐྱིལ་མོ་ཀྲུང་ཕྱེད་པ་ལུས་ཅུང་ཟད་བསྐུམ་པ་བྱའོ། །ཕྱིའི་རི་མོའི་དཀྱིལ་འཁོར་དུ།
en: Firmly established atop Mount Sumeru, they each sit in the partial cross-legged posture with their bodies slightly inclined.

source: ནོར་བུ་དང་། རྡོ་རྗེ་དང་། མེ་ཏོག་དང་། མདུང་རྩེ་གསུམ་པ་དག་གོ། །ཁོར་ཡུག་ཏུ་ཁ་ཁྱེར་འབར་བས།
en: Outside the maṇḍala, the vidyā holder should draw circular lines of jewels, vajra scepters, flowers, and tridents, as well as a surrounding veranda-like structure that blazes with light.

source: དཀྱིལ་འཁོར་གྱི་ཁོར་ཡུག་ཏུ་བརྒྱན་པའོ། །ལྷབ་ལྷུབ་དང་། བ་དན་དང་། རྒྱལ་མཚན་དང་། ཚོན་སྣ་ལྔ་པའི་སྐུད་པས་ཀུན་ནས་དཀྱིལ་འཁོར་ལ་ཡང་དག་པར་བརྒྱན་པའོ།
en: He should adorn the entire maṇḍala with streamers, banners, and flags and stretch a colored thread around it.

source: །རོ་བྲོ་བའི་མཆོག་དང་ལྡན་པའི་གཏོར་མས་གང་བའི་སྣོད་ཅི་འབྱོར་པ་དང་། གཏོར་མའི་ལས་ཀྱི་ཆོ་གས་འབྱོར་པ་དང་། རྗེས་སུ་མཐུན་པར་གཞག་པར་བྱའོ། །བུམ་པ་གང་བ་དང་། པོག་ཕོར་དང་། བུམ་བུ་
en: He should arrange dishes filled with bali articles of the best flavors available and then, following the procedure required for a bali offering, set out full jars, incense holders, water pots, and jars filled with the ‘white’ bali articles.

source: དང་། བུམ་པ་དང་། གཏོར་མ་དཀར་པོས་བཀང་བ་དང་། འབྲས་བུ་རྣམ་པ་སྣ་ཚོགས་པ་ཉིད་དང་། དྲི་དང་། ཕྲེང་བ་དང་། བྱུག་པ་དང་། མེ་ཏོག་ཀུན་ནས་གཅལ་དུ་དགྲམ་མོ། །འབྲས་ཡོས་དང་།
en: He should add fruits, various fragrances, flower garlands, and scented oils, and he should strew the entire maṇḍala with flowers and sprinkle it with parched rice and mustard seeds. “

source: ཡུངས་ཀར་གྱིས་གཏོར་བར་བྱའོ། །སྙིང་པོའི་དཀྱིལ་འཁོར་གྱི་གྲྭར། མཆོད་ཡོན་དང་། ཞབས་བསིལ་གྱི་སྣོད་དང་། རིན་པོ་ཆེ་སྣ་བདུན་རབ་ཏུ་དགྲམ་མོ།
en: In the corners inside the maṇḍala, he should place silver bowls with the offering of argha water for the feet and scatter the seven precious jewels.

source: །དྲིའི་ཆུས་བཀང་བའི་བུམ་པ་དང་། ལེགས་པར་བརྒྱན་པའི་བུམ་པ་བྱས་ནས། མཁས་པས་དར་བཟང་པོ་བཅིངས་ཏེ། དབུས་ཀྱི་དཀྱིལ་འཁོར་དུ་གཞག་པར་བྱའོ།
en: In the center of the maṇḍala, the knowledgeable vidyā holder should place a water pitcher filled with scented water, adorn it well, and tie silk cloth around it.

source: །སྒོ་བཞིར་དྲི་ཆབ་ཀྱིས་གང་བའི་བུམ་པ་དར་གྱིས་བཅིངས་པ་གཞག་པར་བྱའོ། །མཁས་པས་སྒོ་དང་། སྒོ་རུ་ནི། བུ་རམ་དང་། ཤ་ཁ་ར་དང་།
en: He should place such pitchers filled with scented water and tied with silk cloth at each of the four doors.

source: སྦྲང་རྩིའི་རོ་དང་། གཏོར་མ་གཞག་པར་བྱའོ། །མདུང་རྩེ་གསུམ་ལ།
en: At each door, the learned vidyā holder should offer tasty bali articles that contain molasses, sugar, and honey.

source: ཞོ་དང་། འོ་མ་དང་། ཟན་དང་། མཆོག་གི་བཟའ་བ་མ་ཉམས་པས། ཤིན་ཏུ་མཛེས་པའི་གཏོར་མ་གཞག་པར་བྱའོ། །དེ་བཞིན་དུ། འཁུར་བ་དང་། འཁུར་བ་ཟླུམ་པོ་ཉིད་དང་། སྣུམ་འཁུར་དང་། བེ་ཊི་མ་ཀ་དང་། ས་རཱའི་ལ་དུ་དང་། མུད་གའི་ལ་དུ་དང་། ཧྭགས་དང་། ཁ་ཡྻཱ་ནི་བཟང་པོ་རྣམས་གཞག་པར་བྱའོ།
en: Near the tridents he should place a bali consisting of the finest dishes of curds and milk, jars of cream, cakes, pastries, sweetmeats flavored with pine resin, and other divine delicacies. “

source: །གཏོར་མའི་ལས་ལ། ཁོར་ཡུག་ཏུ་མེ་ཏོག་བཟང་པོ་དགྲམ་ཞིང་། ཕྲེང་བས་བརྒྱན་པར་བྱའོ། །འབྲུའི་རྣམ་པ་སྣ་ཚོགས་པ་གཞག་པར་བྱའོ། །འབྲས་བུའི་ངོ་བོ་རྣམ་པ་སྣ་ཚོགས་པ་དང་།
en: Continuing with the bali procedure, the vidyā holder should strew the entire maṇḍala with flowers, adorn it with garlands, and set out various types of grain and fruit.

source: ནེའུ་གསིང་སྔོ་བསངས་དང་། ལོ་མ་མཛེས་པ་བཀྲམ་སྟེ་གཞག་པར་བྱའོ། །ཁོར་ཡུག་ཏུ་མར་མེའི་ཕྲེང་བ་དང་། དེ་བཞིན་དུ། ཨ་ག་རུ་དང་། ཙནྡན་སྤྲྀ་ཀ་དང་། ཏུ་རུཥྐ་དང་། དཔལ་གྱིས་དཀྲིས་པ་དང་།
en: He should spread green grass and leaves and surround the maṇḍala with rows of lamps.

source: གུ་གུལ་དང་། ཀུན་ཏུ་རུ་དང་། སྦྲང་རྩི་དང་། ཧྭགས་སྦྱར་བའི་བདུག་པ་སྟེ། བདུག་པ་འདི་དག་དབུལ་བར་བྱའོ།
en: He should burn incense made of agarwood, sandalwood, fenugreek, olibanum, pine resin, bdellium, and frankinsence mixed with honey and sugar.

source: །དཀྱིལ་འཁོར་གྱི་ཁོར་ཡུག་ཏུ་བདུག་པ་འཐུལ་བའི་པོག་ཕོར་གཞག་པར་བྱ་སྟེ། དཀྱིལ་འཁོར་གྱི་ལྷ་ལ་བདུག་པ་དབུལ་བར་བྱའོ།
en: This incense should be placed all around the maṇḍala, in incense holders that diffuse the scent, as an offering to the maṇḍala deities. “

source: །ཕྱོགས་བཅིངས་པ་དང་། དཀྱིལ་འཁོར་བཅིང་བ་བྱ་སྟེ།
en: Next, the vidyā holder should bind the directions and bind the maṇḍala.

source: གཙུག་ཏོར་བཅིང་ཞིང་། བདག་སྲུང་བ་དང་། གཞན་བསྲུང་བ་བྱའོ།
en: He should tie his hair in a topknot and perform the rites of self-protection and protecting others.

source: །དེའི་འོག་ཏུ་འཇུག་པར་བྱའོ། །རིག་སྔགས་དཀྱིལ་འཁོར་མཆོག་མཐོང་བ་དང་། ཕྱག་བྱ་ཞིང་། བསྐོར་བ་ཉིད་དང་།
en: He should then enter, look at the supreme maṇḍala, bow to it, and circumambulate it clockwise.

source: དམ་ཚིག་ཀྱང་སྦྱིན་པར་བྱའོ།
en: He should then grant the samaya.

source: །རྟག་ཏུ་བསང་བའི་ལས་བྱས་ཏེ། དེ་ཁོ་ན་བཞིན་དུ་གསང་སྔགས་བཟླས་པ་ཡང་བྱའོ།
en: He should always perform these rites in secret, employing the mantra.

source: །དཀྱིལ་འཁོར་གྱི་ཆོ་ག་ཚད་མ་ལས། ད་གོས་པ་འདི་དག་ཐམས་ཅད་བྱས་ནས། དེའི་འོག་ཏུ་རིག་སྔགས་འཆང་གིས་ལས་ཐམས་ཅད་ཀྱི་དངོས་གྲུབ་བླ་ན་མེད་པའོ།
en: Once he has completed all the stages of the rite exactly as required by the maṇḍala procedure, he will be eminently successful in all his activities. “

source: །རྒྱལ་བ་རིགས་བཞིའི་ཡོངས་སུ་བསྐོར་བའི་དཀྱིལ་འཁོར་དུ་ཞུགས་པ་དེ་དག་ཐམས་ཅད་ནི། འགྲོ་བ་བཟང་པོར་སྐྱེ་བར་འགྱུར་རོ།
en: Everyone who enters the maṇḍala will then join the retinue of the Victorious One corresponding to one of the four colors, and they will all experience good rebirth.

source: །དེ་བཞིན་དུ་བདེ་བ་ཅན་དུ།
en: They will go to the realm of Sukhāvatī in the retinue of the Victorious One; there is no doubt about this.

source: འོད་དཔག་མེད་ཀྱི་སྤྱན་སྔར་པདྨ་ལས་བརྫུས་ཏེ་སྐྱེ་བར་ཐེ་ཙོམ་མེད་དོ། །ལྷའི་གཟུགས་ཤིན་ཏུ་མཛེས་པ་རྒྱན་ཐམས་ཅད་ཀྱིས་རྣམ་པར་བརྒྱན་པ།
en: They will be spontaneously born from a lotus flower in the presence of Amitābha, with divinely beautiful forms that are adorned with all ornaments.

source: འཇིག་རྟེན་ལས་འདས་པའི་དངོས་གྲུབ་ཆེན་པོ་ཐོབ་པར་འགྱུར་ཏེ། འདི་ལ་ཐེ་ཙོམ་མི་བྱའོ།
en: They will attain great supramundane accomplishments; there is no doubt about this.

source: །འཇིག་རྟེན་པའི་དཀྱིལ་འཁོར་གྱི་དངོས་གྲུབ་བླ་ན་མེད་པ་དང་། ཆོ་ག་ཞིབ་མོའི་དངོས་གྲུབ་དང་། ཕྱག་རྒྱའི་དངོས་གྲུབ་དང་།
en: They will win the supreme worldly accomplishments of the maṇḍala, the ritual, the mudrā, and the mantra of Krodharāja. “

source: ཁྲོ་བོའི་རྒྱལ་པོ་དངོས་གྲུབ་བླ་ན་མེད་པ་དང་། སྡིག་པ་དང་། སྒྲིབ་པ་ཐམས་ཅད་སེལ་བ་དང་།
en: This rite will instantly remove all the vidyā holder’s wrongdoings and obscurations and will eradicate all his vices.

source: མོད་ལ་གདུག་པ་ཐམས་ཅད་འཇིག་པ་དང་། དགྲ་ཐམས་ཅད་བཟློག་པ་དང་། མོད་ལ་ནད་ཐམས་ཅད་རབ་ཏུ་ཞི་བ་དང་། དགོས་པ་ཐམས་ཅད་དང་། ཐམས་ཅད་དུ་དངོས་གྲུབ་བླ་ན་མེད་པ་གང་ཡིན་པ་གྲུབ་པར་འགྱུར་རོ།
en: It will instantly suppress all his enemies, pacify all his diseases, and bring success, supreme success, in all his activities.

source: །འཇིག་རྟེན་ཐམས་ཅད་ཀྱི་མངའ་བདག་དང་རྟག་ཏུ་དགའ་བར་འགྱུར་རོ། །དེ་རྟག་ཏུ་རྗེས་སུ་འབྲང་བར་འགྱུར་རོ། །རྟག་ཏུ་རྒྱལ་པོ་དང་། བློན་པོར་བཅས་པ་རྣམས་ཀྱིས་དུས་རྒྱུན་དུ་བླ་ན་མེད་པའི་མཆོད་པའི་གནས་སུ་འགྱུར་རོ།
en: He will be lord of the entire world, be loved and followed by everyone, and receive supreme worship from kings, ministers, and others.

source: །གཞན་ཡང་ལྗོངས་ཐམས་ཅད་བལྟ་ཞིང་མཆོད་པས་རྗེས་སུ་འབྲང་བར་འགྱུར་རོ། །དེ་བཞིན་ཉིད་དུ་ཡང་དགེ་སྦྱོང་རྣམས་དང་། བྲམ་ཟེ་རྣམས་དང་། རྒྱལ་རིགས་དང་། རྗེའུ་རིགས་དང་། དམངས་རིགས་དང་།
en: All people everywhere will run after him in order to see and worship him, including monks, brahmins, kṣatriyas, vaiśyas, and śūdras.

source: སྐྱེས་པ་དང་། བུད་མེད་དང་། ཁྱེའུ་དང་། བུ་མོ་ཐམས་ཅད་ཀྱང་དགའ་བར་འགྱུར་རོ། །རྟག་ཏུ་ཚིག་བཙན་པ་དང་།
en: All women, men, boys, and girls will always love him and be filled with the utmost devotion for him. “

source: རྟག་ཏུ་ལྷ་རྣམས་ཀྱིས་མངོན་པར་བསྲུངས་པ་དང་། སྐབས་གསུམ་གྱི་དབང་པོ་དང་། རྡོ་རྗེ་འཆང་བ་ཉིད་དང་། རྡོ་རྗེ་སྙིང་པོ་བདག་ཉིད་ཆེན་པོ་དང་། ཚངས་པ་དང་། ཁྱབ་འཇུག་དང་། དབང་ཕྱུག་ཆེན་པོ་དང་། གཞོན་ནུ་དང་། དགའ་བྱེད་དབང་ཕྱུག་དང་།
en: His words will be pleasant to hear, and he will always be protected by deities such as the thunderbolt-wielding lord of the realm of Thirty-Three, the great being with thunderbolt-like nature, as well as by Brahmā, Viṣṇu, Maheśvara, Kumāra, Nandikeśvara, Yama, Varuṇa, and the Four Great Kings.

source: གཤིན་རྗེ་དང་། ཆུ་ལྷ་ཉིད་དང་། དེ་བཞིན་དུ་རྒྱལ་པོ་ཆེན་པོ་བཞི་རྣམས་རྟག་ཏུ་རྗེས་སུ་འབྲང་བར་འགྱུར་རོ། །ཁྲོ་བོའི་དཀྱིལ་འཁོར་དུ་ཞུགས་ཤིང་མཐོང་བ་ལ་ཡང་དུས་རྟག་ཏུ་སྲུང་བ་དང་།
en: They will always support a vidyā holder who has entered and seen the maṇḍala of Krodharāja, and they will be ever ready to protect him.

source: རྗེས་སུ་འབྲང་བར་འགྱུར་ཏེ་ཐེ་ཙོམ་མི་བྱའོ།
en: There is no doubt about this. “

source: །ཡུན་རིང་དུ་འཚོ་བར་འགྱུར། རྟག་ཏུ་སྨྲ་བ་ཉུང་ཞིང་མཁས་པ་དང་། ཐམས་ཅད་དུ་དངོས་གྲུབ་ཐོབ་པར་འགྱུར་རོ།
en: The knowledgeable vidyā holder will live a long life with few quarrels and will be successful in every respect.

source: །དཀྱིལ་འཁོར་མཐོང་བ་དང་། འཇུག་པ་ལ་དགའ་བར་འགྱུར།
en: He will always delight in entering and looking at the maṇḍala and will be loved by all buddhas and bodhisattvas.

source: སངས་རྒྱས་དང་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ཀྱིས་ཀྱང་དགྱེས་པ་དང་བཅས་པས་བྱིན་གྱིས་རློབ་པར་འགྱུར་རོ། །སངས་རྒྱས་རྣམས་དང་། འཇིག་རྟེན་ལས་འདས་པ་དང་། དེ་བཞིན་གཤེགས་པས་དབུགས་འབྱིན་པར་འགྱུར། སངས་རྒྱས་ཐམས་ཅད་ཀྱི་ཐུགས་ལས་སྐྱེས་པའི་སྲས་ཇི་ལྟ་བ་བཞིན་ནོ།
en: Every buddha and transcendental tathāgata will give him their blessing, comfort, and encouragement, as if he were their beloved son.

source: །འདི་ནི་དེ་རྣམས་ཀྱི་མངལ་གྱི་གནས་སུ་སྐྱེ་བའི་ཐ་མ་ཡིན་ནོ།
en: His current birth will be his last, and he will never be soiled by birth from a womb again.

source: །རྟག་ཏུ་སྐྱེ་བའི་སྐྱེ་བ་དྲན་པར་འགྱུར་ཏེ། འདི་ལ་ཐེ་ཙོམ་མི་བྱའོ།
en: He will be able to remember his successive births; there is no doubt about this. “

source: །སངས་རྒྱས་ཀྱི་བྱང་ཆུབ་ཏུ་འགྲོ་བ་དང་། རྟག་ཏུ་རྒྱལ་བ་རྣམས་ཀྱི་དེ་ཁོ་ན་ཉིད་མཐོང་བ་དང་། རྟག་ཏུ་སངས་རྒྱས་ཐམས་ཅད་ལ་མངོན་སུམ་དུ་ཆོས་ཉན་པར་ཐེ་ཙོམ་མེད་དོ།
en: Continually progressing toward the awakening of a buddha, the vidyā holder will be able to see the victors as they truly are, and he will receive the Dharma teachings of all the buddhas directly from them. There is no doubt about this.

source: །འདི་ནི་སྐྱེ་བའི་ཐ་མ་ཡིན་ཏེ། ཇི་སྲིད་དུ་སངས་རྒྱས་ཀྱི་བྱང་ཆུབ་ཏུ་རྫོགས་པར་སངས་རྒྱས་པར་འགྱུར་རོ།
en: His present birth will be the final one, before he fully realizes the awakening of a buddha.

source: །དགོས་པ་གཞན་རྣམ་པ་སྣ་ཚོགས་པ་དང་། ཁྲོ་བོ་ལྕགས་ཀྱུའི་ལས་བརྒྱ་ཕྲག་སྟོང་རྣམས་རང་གི་འདོད་པའི་བློས་བྱའོ།
en: He will also be able to accomplish hundreds of thousands of various tasks and activities.

source: །ཐམས་ཅད་དུ་ལན་ཅིག་བཟླས་བརྗོད་བྱས་ལ།
en: Whatever his task, he should focus his mind and thoughts on Krodhāṅkuśa and mindfully repeat his mantra one time.

source: ཐམས་ཅད་དུ་ལས་ཐམས་ཅད་བྱའོ།
en: He can then perform any activity whatsoever.

source: །བཀླགས་པས་འགྲུབ་པའི་ཆོ་གའོ།། །།
en: This completes the practice procedure that can be accomplished through study.”

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་གིས། བཅོམ་ལྡན་འདས་ཀྱི་ཞལ་དུ་བལྟས་ཏེ།
en: Noble Avalokiteśvara, the great bodhisattva being, looked at the face of the Blessed One and smiled.

source: བཞིན་འཛུམ་པས་ཁྲོ་བོ་ཆེན་པོ་ལྕགས་ཀྱུའི་གཟུངས་ཀྱི་ཀུན་ཏུ་སྣང་བཞིན་པའི་འོད་ཟེར་སྣ་ཚོགས་འབར་བའི་སྙིང་པོ་ལུས་ལས་ཕྱུང་ངོ་། །གང་གིས་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་ཀུན་ཏུ་སྣང་བར་བྱས་སོ།
en: He then pronounced the dhāraṇī of the great Krodhāṅkuśa and simultaneously sent forth rays of multicolored light from his radiant body, illuminating the world spheres of the great trichiliocosm.

source: །འོད་ཟེར་གྱི་སྣང་བ་གང་གིས། སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་སུ་རིན་པོ་ཆེ་སྣ་བདུན་གྱི་ཆར་འབབ་པའི་སྙིང་པོ་རབ་ཏུ་འབེབས་པར་འདོད་པའི་དོན་དང་།
en: When the world spheres in the great trichiliocosm became illuminated by these rays of light, a rain of seven types of jewels began to fall, each jewel permeated by inner light.

source: ལྷའི་མེ་ཏོག་སྣ་ཚོགས་ཀྱི་ཆར་འབེབས་པའི་དོན་དང་། ལྷའི་དྲི་དང་མཐུན་པར་གསལ་བའི་དྲི་དང་རྗེས་སུ་མཐུན་པའི་དྲི་རྣམ་པར་བཀྲ་བའི་ཆར་རྣམས་ཀྱིས་བཅོམ་ལྡན་འདས་དང་། འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་ལ་ཕབ་བོ།
en: A rain of various divine flowers and divine fragrances fell upon the Blessed One and the noble lord Avalokiteśvara, filling the air with various scents and subtle fragrances.

source: །རབ་ཏུ་དགྱེས་པའི་ཐུགས་ཀྱིས་ལྷའི་ཆུ་གསལ་ཞིང་རྒྱ་ཆེ་བ།
en: With a heart full of joy, the noble lord Avalokiteśvara emitted from his forehead divine water that sparkled with light and diffused fragrance far and wide.

source: དྲི་འཕྲོ་བས་རྣམ་པར་མཛེས་པའི་དཔྲལ་བའི་ཆུ་མུ་ཏིག་དང་མཉམ་ཞིང་མཚུངས་པ།
en: The drops of this radiant spray of water looked exactly like pearls or nutmeg.

source: ཛ་ཏིའི་འབྲས་བུ་དང་འདྲ་བར་རྣམ་པར་མཛེས་པའི་དཔྲལ་བའི་ལྷའི་ཆུས་ཡོངས་སུ་དབང་བསྐུར་ཏེ། ཐིགས་པ་ནམ་མཁའ་དང་མཉམ་པ་བཞུ་བའི་མིག་འབྲས་ལས་ལྷུང་བའི་ཆུ་སྐར་མ་ལས་རབ་ཏུ་ལྷུང་བའི་གོས།
en: As the water sprayed across the firmament of the sky, the drops embedded themselves there as stars.

source: དེ་ལྟ་བུའི་དཔྲལ་བར་ཐིག་ལེ་འབར་བ་ཉི་མ་དང་། སྨིག་རྒྱུ་རྣམ་པར་མཛེས་པའི་འོད་ཟེར་ས་ལ་ལྷུང་སྟེ། བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔར་ཞབས་ཀྱི་དྲུང་དུ་ལྷུང་ངོ་། །པདྨའི་འདབ་མ་བརྒྱ་སྟོང་ཕྲག་ཁ་བྱེ་བ་ལྟར་རབ་ཏུ་འཛུམ་པས་རྣམ་པར་མཛེས་པ། པདྨའི་ཟེ་འབྲུ་ལྟར་མཉེན་པ་བྱུང་བར་གྱུར་ཏོ།
en: The drops emerging from his forehead, bright as the blazing sun, illuminated the ground in front of the Blessed One and formed the shape of a half-opened lotus, clearly visible at the Blessed One’s feet, with one hundred thousand bright and colorful petals, soft and silky kernels, and a radiant stalk the color of beryl.

source: །བཻ་ཌཱུརྱའི་སྡོང་བུ་ཉི་མ་བརྒྱ་སྟོང་ཕྲག་པས་ལྷག་པའི་མཐུ་སྟོབས་དང་ལྡན་པའི་འོད་ཟེར་སྣང་བས་འབར་བཞིན་པ། བཅོམ་ལྡན་འདས་ལ་མི་གང་གི་ཚད་ལྟ་བུར་གནས་པར་གྱུར་ཏོ།
en: As tall as a human, it stood before the Blessed One, shining brighter than one hundred thousand suns.

source: །དེ་ནས་རིག་པ་འཛིན་པའི་དབང་པོ་ཆེན་པོ་རྡོ་རྗེ་འཆང་གིས། ཆུའི་ཐིགས་པ་འདབ་མ་མཉམ་པ། བཻ་ཌཱུརྱ་མཆོག་ཏུ་མཛེས་ཤིང་འབར་བ་པདྨ་ཁ་བྱེ་བ་དེ་མཐོང་ནས། ཐུགས་ངོ་མཚར་དང་། ཡ་མཚན་སྐྱེས་ཏེ།
en: Vajradhara, the great lord of vidyā holders, saw the half-opened, radiant lotus, its delicate petals shining with beryl-colored light, and became filled with wonder.

source: བཅོམ་ལྡན་འདས་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་གི་ཞབས་གཉིས་ལ་ཕྱག་འཚལ་ཏེ། འདི་སྐད་ཅེས་གསོལ་ཏོ།
en: His curiosity rose, so he prostrated at the feet of the blessed Avalokiteśvara, the great bodhisattva being, and asked, “O great being!

source: །སེམས་དཔའ་ཆེན་པོ་ཤིན་ཏུ་ངོ་མཚར་བ་མཐོང་ལགས་སོ།
en: I see something truly amazing.

source: །རྨད་དུ་བྱུང་བའི་ཆོ་འཕྲུལ་ཆེན་པོ་མཐོང་ལགས་སོ།
en: I see a great miraculous display.

source: །སེམས་དཔའ་ཆེན་པོ་བདག་གིས། ལྟད་མོའི་མཆོག་མཐོང་ལགས་སོ།
en: I am absolutely mystified, O great being, by what I see.

source: །སེམས་དཔའ་དག་པ་ཆེན་པོ། ཁྱོད་ཀྱིས་བདག་གི་ལྟད་མོའི་ཐེ་ཙོམ་མེད་པར་མཛོད་ཅིག་ཅེས་སོ།
en: Please satisfy my curiosity, O pure great being!”

source: །དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་གིས། གནོད་སྦྱིན་གྱི་སྡེ་དཔོན་ཆེན་པོ་ལག་ན་རྡོ་རྗེ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །ལག་ན་རྡོ་རྗེ།
en: Noble Avalokiteśvara, the great bodhisattva being, replied to Vajrapāṇi, the great yakṣa general, “I am the keeper of a mantra, a king of vidyās, sealed by mudrā as the deity of the maṇḍala.

source: བདག་ལ་དོན་ཡོད་པ་པདྨ་དྲི་མ་མེད་པ་ཆུ་སྐྱེས་ཀྱི་ཞབས་ཀྱི་ལྕགས་ཀྱུ་ཞེས་བྱ་བ། དོན་ཡོད་ཞགས་པའི་སྙིང་པོ། རིག་སྔགས་ཀྱི་རྒྱལ་པོའི་དཀྱིལ་འཁོར་ཆེན་པོ་དང་། ཕྱག་རྒྱ་དང་། ལྷ་རྣམས་ཡོད་དེ།
en: This mantra is the heart essence of Amoghapāśa called the unfailing lotus noose-goad as pure as a lotus.

source: དེ་བདག་གིས་བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔར་འཁོར་ཆེན་པོའི་དབུས་སུ། དེ་བཞིན་གཤེགས་པའི་སྤྱན་སྔར་ཡོངས་སུ་བསྒྲག་པར་བགྱིའོ། །དེའི་མཐུ་དང་།
en: I will now proclaim this mantra in front of you, in this great assembly, in the presence of the Tathāgata.

source: རིག་སྔགས་ཀྱི་རྒྱལ་པོའི་མཐུ་སྟོབས་ཀྱི་རྫུ་འཕྲུལ་གྱི་ཆོ་འཕྲུལ་གྱི་རྣམ་པར་འཕྲུལ་པ་འདི་མཐོང་ངོ་།
en: It is by the power of the Tathāgata’s blessing, and by the power of this king of vidyās, that this miraculous display of magic has manifested itself.

source: །དེའི་མཐུས་པདྨ་འདི་བྱུང་ངོ་།
en: It is by its power that this lotus has appeared.

source: །རིག་སྔགས་ཀྱི་རྒྱལ་པོ་འདི་བདག་གི་དཔྲལ་བ་ནས་ཕྱུང་བས་ཆོ་འཕྲུལ་གྱི་རྣམ་པར་འཕྲུལ་པ་རྒྱ་ཆེ་ཞིང་ཆེ་བ་དང་ཡང་དག་པར་ལྡན་པར་གྱུར་ཏོ།
en: I have caused this king of vidyās to emerge out of my forehead. This is accompanied by a vast and great miraculous display.”
